# CircleLightShape Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CircleLightShape Class
Members See Also
---
This class encapsulates a circle light shape.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class CircleLightShape : LightShape
```

Visual Basic
---
```text
Public Class CircleLightShape _
	Inherits LightShape
```

Visual C++
---
```text
public ref class CircleLightShape : public LightShape
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightShape Autodesk.Revit.DB.Lighting..::..CircleLightShape
# See Also
CircleLightShape Members
Autodesk.Revit.DB.Lighting Namespace